{
	"experiences": "Co-op Experiences\n\nMy co-op experiences have been with Siemens Software in Milford. I have worked for three separate teams during my time working with them. \n\nMy first co-op rotation was with the Structure Manager team for Active Workspace, the web implementation of Siemens' Teamcenter product. I worked with writing tests using Cucumber. During this time, I learned about the three-tier development method of web design using Model, View, and Controller (MVC). I also learned about using chrome's dev tools to debug a front-end web solution. Another major component of this semester was legacy code development. My manager went out of his way to make sure I had reading materials for best practices and the importance of being able to work with and improve legacy systems. I also was exposed to C++ development in a legacy environment.\n\nMy second co-op rotation was with the Structure Manager team for Active Workspace once again. The biggest change was the exposure to the Agile method of developing a product. I was able to participate in scrums and learn about how different developers working in certain parts of the codebase could help one another. I also spent a significant amount of time working with Javascript, modernizing a solution we changed to the Angular method of development to better utilize selectors. \n\nMy third rotation saw me changing to the Fourth Generation Development (4GD) section of Active Workspace's development. In this group, I learned about the layers of bureaucracy it can take to implement a new feature in a legacy product. I created an improvement to Teamcenter for Electric Boats using Java. I created and modified karma tests for Javascript during this time, as well. This rotation also had my first exposure to React. \n\nMy fourth rotation was with the Advanced Solutions division of Siemens. While with this team, I architected a front-end solution for a potential product. This required implementing HTML5 features which were not known to all browsers. I utilized React as my framework for the project, and the project went through three separate versions during my semester there. I became familiar with Javascript + CSS + HTML methods and patterns for web design. I also spent time researching semantic databases generally and Stardog specifically, well enough to be able to query a triple store using SPARQL. During this rotation, I learned about the pressure that can come with needing to deliver a product on time; how to create compromises with management and make sure that shareholders were aware of how far along the project was. I also learned how to use Git and Docker during this time. \n\nFor my fifth and last co-op rotation, I remained at Siemens Software's Advanced Solutions team. Due to my previous experience, I was assigned to implementing a reactive front-end solution for another project. I also helped to debug and document a front-end solution for another toolkit that we were working that involved machine learning. During this time, I was exposed to a project from Georgia Tech that utilized Deep Q Learning From Demonstration to suggest state changes to the user. I learned about how to use Tensorflow as a result. I explored the possible implementations of a 'knowledge graph', and gathered enough information to accurately represent results for a (semantic database's) triple store in WebVowl format. I spent time learning to create presentations about the research I had performed, well enough that I could communicate that learning with others using PowerPoint. I was also able to mentor a fellow intern during this semester. This let me use my experience to help them to excel. "
}