{
	"projects": "Personal Projects\n\nBasic React App:\nThe website you are viewing this profile on is something that I came up with, using the experience I gained from my fourth co-op rotation. (~3/20/2019). I created it on my own time using techniques I learned while at Siemens Software. I used React and React Router to create the project. I used Github Pages and the gh-pages React package to host it. I did it to create a set of universal tools for presenting information. I also created a set of components that would allow for one to create an organizational chart, or roster, with images accompanying each one. I learned how to import images into a webapp, how to host a webapp using Github Pages, and how to use github generally as a result of this project. \n\nDiscord Management Bot:\nI created a discord bot for managing tasks in a pin on 5/24/2018. In August of 2019 I began rapidly improving upon it. It uses Discord JS, a Javascript library for managing data. I learned how to manipulate strings extensively through this library's implementation. While I did not have access to a back-end, I learned how to use pins as a temporary data-store, and also learned how to use Vultr to host a private server for my bot. \n\nPersonal Activities\n\nSummer Church Program - June 2010, 2012, 2013, 2015\nI was a group leader for a group of schoolchildren for Faith Community United Methodist Church for four years. During this time, I was able to apply techniques I had learned about leadership from Scouting with a group of individuals who were not always focused on their current task. Every summer I was able to be a group leader, I felt like I made a difference from my participation in this program. \n\nBearcats Band Member - Fall 2015\nDuring fall of 2015, I played percussion for the Bearcats Marching Band. I had experience playing percussion throughout high school, and was able to use this experience with the band program here at the university. For six months we practiced and performed in various parades, football games, and a competition event. \n\nBoy Scouts of America - Eagle Scout\nMy proudest achievement is the Eagle Scout rank that I was able to accomplish at the end of my career with the Boy Scouts of America. My Eagle Scout Project was creating a patio for outdoor events at Gorman Heritage Farms in Glendale, Ohio.\n\nLeadership Activities\nBoy Scouts Program - Senior Patrol Leader (Fall 2014)\nDuring the Fall of 2014, I was the Senior Patrol Leader for Troop 962 of West Chester, Ohio. This was the last position I would have as a member of Troop 962, and during that time I was responsible for organizing troop campouts, implementing new ideas for the troop, coordinating with adult leadership within the troop, and managing the various patrol leaders. I learned about managing a group of other leaders with their own ambitions and goals. I also learned about how to deal with being the top member of an organization that has others in an organization even above them. I distinctly remember being in a position where I felt like I needed help from someone else, but the only one who could provide leadership at the time was me, so I had to rise to the occasion, such as when I discovered a rough situation between two of the members of my troop. "
}