{
	"resume": "Career Goals:\nI plan on becoming an expert in the field of Data Science. The potential I see for data being utilized to better the lives of people excites me. I want to be at the forefront of this kind of research. I want to be able to watch the world change as a result of these techniques being implemented. I want to create systems that make it easier to implement these kinds of techniques. I see myself getting my Masters in artificial intelligence and eventually a PhD in that field. I am not interested in research; I want to see the applications of these ideas and mentor/enable others to continue those implementations. \nStrengths\nCommunication\nFor me, communication means that I am using what I know to improve the effectiveness of those around me. During my fifth and final co-op, I was required to research a new implementation of a machine learning project. The project had several bugs; during the course of the semester, any bugs I encountered which I believed I had the solution to, I would pass those ideas back to the development team for the project. I did not have the solution myself; but the insights I was able to gather would be helpful in solving those issues. Even if I do not know the answer to a problem, my ability to communicate what I do know will help me find more effective solutions in the future. \n\nLeadership\nTo me, leadership is the ability to take a problem and say 'this is how we will resolve it'. During my fourth co-op rotation, I was required to take leadership over the architecture of a web application. I decided to use the React framework, which greatly increased the speed at which I was able to develop the product. This choice of implementation meant that I was later able to use those components for other projects, and use them as educational materials for co-ops who would join our team during our fifth rotation. This sense of leadership and exploring different solutions will help me to find innovative ways of improving processes and ending confusion among my team members. \n\nMentorship\nMy biggest achievement during my fifth rotation was mentoring a fellow intern on my team. I would do pair programming to show how I would approach a solution; after a few examples, I was no longer needed, and that intern was able to complete several similar projects. That mentorship also came back to help me; because of that interaction I had shared, my relationships at work improved, and I was able to be mentored in return on subjects that that intern was more experienced in than myself.\n\nCompromise\nOne example of my compromising nature that comes to mind is my time working with the Boy Scouts of America. There were numerous incidents where we needed to do the dishes after having eaten dinner. I understood that no member of my troop inherently wanted to do dishes; however, that said, in my position of leadership I had to make sure it got done. Therefore, I tried to find a middle ground of sorts; I would always look for the solution that made sure each member of my troop knew I was thinking about them in some regard. Whether that was making sure we played some kind of game together after dinner, or organizing the schedule in such a manner that satisfied each member of the cleanup crew. It did take a bit more work on my end, but overall it was a lot more fun working with an engaged clean-up crew than one who had been impressed into doing the job. \n\nResearching\nDuring my last two co-op rotations, I was with a research team. I learned that I enjoyed performing research tasks to improve the knowledge base of my team. One of those things that I researched was the React framework. I faced pushback on implementing this framework; so I created a presentation on its advantages for my team. Ultimately, this resulted in me being able to produce a front end solution using React as the framework, and the experiences I gained from that implementation I was able to later implement with refactoring a different web application."
}